Tekla Open API Reference for Tekla Structures 2025
RebarSplitter.SplitOffset Property
 Gets or sets the offset of the split from the location of the rebar splitter.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double SplitOffset { get; set; }
Public Property SplitOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarSplitter Class
Tekla.Structures.Model Namespace